<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1a DEMO - Data Wrangling

# Data

> The sinking of the RMS Titanic is one of the most infamous shipwrecks in history.  On April 15, 1912, during her maiden voyage, the Titanic sank after colliding with an iceberg, killing 1502 out of 2224 passengers and crew. This sensational tragedy shocked the international community and led to better safety regulations for ships.

> One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class.

In this lab, we'll explore this dataset to find insight.

[Titanic Dataset](https://www.kaggle.com/c/titanic/data)

# Data Dictionary

| Variable |                                 Definition | Key                                            |
|----------|-------------------------------------------:|------------------------------------------------|
| Survival | Survival                                   | 0 = No, 1 = Yes                                |
| Pclass   | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| Sex      | Sex                                        |                                                |
| Age      | Age in years                               |                                                |
| SibSp    | # of siblings / spouses aboard the Titanic |                                                |
| Parch    | # of parents / children aboard the Titanic |                                                |
| Ticket   | Ticket number                              |                                                |
| Fare     | Passenger fare                             |                                                |
| Cabin    | Cabin number                               |                                                |
| Embarked | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |

# Loading Modules

In [1]:
# Load necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

# Loading Dataset

Read titanic dataset.

In [3]:
# Read Titanic Dataset... If in case the "titanic.csv" is missing, import "titanic_train.csv"
titanic_csv = '../../DATA/titanic_train.csv'
titanic = pd.read_csv(titanic_csv)

In [5]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# #from google drive. #not working.
# from google.colab import drive
# drive.mount('/content/drive')
# path = '../../DATA/titanic_train.csv'
# titanic = pd.read_csv(path)
# titanic.head()

In [ ]:
# from local machine
# from google.colab import files
# uploaded = files.upload()

In [ ]:
# import pandas as pd
# import io

# titanic = pd.read_csv(io.BytesIO(uploaded['titanic.csv']))
# titanic.head()

# Explore Dataset

## Head
Displays the first 5 rows of the data

In [6]:
# Check Head
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Tail
Displays the last 5 rows of the data

In [7]:
# Check Tail
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Sample
Displays the random 1 rows from the data

In [8]:
titanic.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
704,705,0,3,"Hansen, Mr. Henrik Juul",male,26.0,1,0,350025,7.8542,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
243,244,0,3,"Maenpaa, Mr. Matti Alexanteri",male,22.0,0,0,STON/O 2. 3101275,7.1250,NaN,S
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S

### Exporting a data sample or even a dataframe to csv...
## "<dfname>.to_csv()"

In [9]:
sample1 = titanic.sample(5)

In [10]:
sample1.to_csv('sample1.csv', index=False)

## Shape

Find shape of dataset.

In [11]:
# ANSWER
titanic.shape

(891, 12)

## Check Types of Data

Check types of data you have

In [12]:
# ANSWER
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Check Null Values

Check whether dataset have any null values.

In [14]:
# ANSWER
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
# Check titanic data again
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Filter for all female passengers

SQL equivalent:

```
SELECT *
FROM titanic
WHERE Sex = "female"
```

In [ ]:
pd.set_option('display.max_rows', None)

In [16]:
# select all female passengers
female_pass = titanic[(titanic['Sex'] == 'female')]
female_pass

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [17]:
titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [18]:
titanic['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [19]:
# Try multiple conditions (AND)
titanic[(titanic['Sex'] == 'female') & (titanic['Pclass'] == 1)].shape

(94, 12)

In [20]:
# Try multiple conditions (OR)
titanic[(titanic['Sex'] == 'female') | (titanic['Pclass'] == 1)].shape

(436, 12)

## What is the mean fare by Pclass?

SQL equivalent:

```
SELECT Pclass, AVG(Fare)
FROM titanic
GROUP BY Pclass
```

In [29]:
# Mean fare for all titanic passengers
round(titanic['Fare'].mean(), 2)

32.2

In [28]:
# how many classes are there in Pclass?

classes = list(titanic['Pclass'].sort_values().unique())
classes

[1, 2, 3]

### First pass: Using loops

In [30]:
# Find unique values in Pclass
classes = titanic['Pclass'].sort_values().unique()

# Save empty list to store mean fare of each class
mean_list = []
count_list = []

# loop: for each Pclass, find the mean fare and store in list
for p_class in classes:
    mean = titanic[titanic['Pclass'] == p_class]['Fare'].mean()
    mean_list.append(mean)

    count = len(titanic[titanic['Pclass'] == p_class]['Fare'])
    count_list.append(count)

    # print("Loop {}".format(p_class))
    # print(mean_list)
    # print(count_list)

print(mean_list, count_list)

[84.1546875, 20.662183152173913, 13.675550101832993] [216, 184, 491]

In [31]:
# How do we get our lists into a DataFrame?

fare_stats_df = pd.DataFrame({'Pclass': classes, 'Count': count_list, 'Mean Fare': mean_list}) # Keys are column names, values are lists
fare_stats_df

   Pclass  Count  Mean Fare
0       1    216  84.154687
1       2    184  20.662183
2       3    491  13.675550

### Alternate: Use `groupby()` method

In [32]:
# Find mean fare grouped by Pclass

fare_mean_count = titanic.groupby(['Pclass'])['Fare'].mean()
fare_mean_count

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [33]:
# Find mean fare grouped by Pclass

fare_mean_count = titanic.groupby(['Pclass'])['Fare'].agg(['count', 'mean'])
fare_mean_count

        count       mean
Pclass
1         216  84.154687
2         184  20.662183
3         491  13.675550

In [34]:
# Find mean fare grouped by Pclass

fare_summ_stats = titanic.groupby(['Pclass'])['Fare'].agg(['count', 'min', 'mean', 'median', 'std', 'max'])
fare_summ_stats.columns = ['No. of Passengers', 'Min. Fare', 'Avg. Fare', 'Median Fare', 'Std. Dev. Fare', 'Max Fare']
fare_summ_stats

,No. of Passengers,Min. Fare,Avg. Fare,Median Fare,Std. Dev. Fare,Max Fare
Pclass,,,,,,
1,216,0.0,84.154687,60.2875,78.380373,512.3292
2,184,0.0,20.662183,14.2500,13.417399,73.5000
3,491,0.0,13.675550,8.0500,11.778142,69.5500

## Rename columns

In [35]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [43]:
new_col = list(titanic.columns)

new_col[2] = 'pcl'
new_col

['PassengerId',
 'Survived',
 'pcl',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [44]:
titanic.columns = new_col
titanic

,PassengerId,Survived,pcl,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
print(fare_mean_count.columns)

Index(['count', 'mean'], dtype='object')

In [45]:
# Rename columns by assigning list of new column names to .columns
fare_mean_count.columns = ['No. Passengers', 'Mean Fare']
fare_mean_count

        No. Passengers  Mean Fare
Pclass
1                  216  84.154687
2                  184  20.662183
3                  491  13.675550

In [46]:
# Using .rename() on index and columns
fare_mean_count2 =  fare_mean_count.rename(index={1: 'First',
                                                  2: 'Second',
                                                  3: 'Third'},
                                           columns={'No. Passengers': 'Count',
                                                    'Fare': 'Mean'})
fare_mean_count2

        Count  Mean Fare
Pclass
First     216  84.154687
Second    184  20.662183
Third     491  13.675550



---



---



> > > > > > > > > Â© 2024 Institute of Data


---



---